export const PRIVACY_POLICY = `
Согласие на обработку персональных данных

Предоставляя свои персональные данные, Заказчик даёт согласие на их обработку, хранение и использование на основании ФЗ № 152-ФЗ «О персональных данных» от 27.07.2006 г. в следующих целях:

• Осуществление клиентской поддержки
• Получение Заказчиком информации о маркетинговых событиях
• Выполнение Исполнителем обязательств перед Заказчиком
• Проведение аудита и прочих внутренних исследований с целью повышения качества предоставляемых услуг

Под персональными данными подразумевается любая информация личного характера, позволяющая установить личность Заказчика, такая как:

• Фамилия, Имя, Отчество
• Адрес электронной почты

Персональные данные Заказчиков хранятся исключительно на электронных носителях и обрабатываются с использованием автоматизированных систем, за исключением случаев, когда неавтоматизированная обработка необходима в связи с исполнением требований законодательства.

Продавец обязуется не передавать полученные персональные данные третьим лицам, за исключением следующих случаев:

• По запросам уполномоченных органов государственной власти РФ только по основаниям и в порядке, установленным законодательством РФ
• Стратегическим партнёрам, которые работают с Исполнителем для предоставления продуктов и услуг, или тем из них, которые помогают Исполнителю реализовывать продукты и услуги потребителям. Мы предоставляем третьим лицам минимальный объём персональных данных, необходимый только для оказания требуемой услуги или проведения необходимой транзакции

Исполнитель оставляет за собой право вносить изменения в одностороннем порядке в настоящие правила, при условии, что изменения не противоречат действующему законодательству РФ. Изменения условий настоящих правил вступают в силу после их публикации на Сайте https://foto-mix.ru
`.trim();
