export interface Region {
  name: string;
  cities: string[];
}

export const russianRegions: Region[] = [
  {
    name: "Алтайский край",
    cities: ["Барнаул", "Бийск", "Рубцовск", "Новоалтайск", "Камень-на-Оби", "Славгород", "Яровое", "Алейск", "Заринск", "Белокуриха", "Горняк", "Змеиногорск"]
  },
  {
    name: "Амурская область",
    cities: ["Благовещенск", "Белогорск", "Свободный", "Тында", "Зея", "Райчихинск", "Шимановск", "Завитинск", "Сковородино"]
  },
  {
    name: "Архангельская область",
    cities: ["Архангельск", "Северодвинск", "Котлас", "Новодвинск", "Коряжма", "Мирный", "Няндома", "Онега", "Шенкурск", "Вельск", "Каргополь"]
  },
  {
    name: "Астраханская область",
    cities: ["Астрахань", "Ахтубинск", "Знаменск", "Камызяк", "Нариманов", "Харабали", "Лиман", "Красный Яр"]
  },
  {
    name: "Белгородская область",
    cities: ["Белгород", "Старый Оскол", "Губкин", "Шебекино", "Алексеевка", "Валуйки", "Строитель", "Грайворон", "Короча", "Новый Оскол"]
  },
  {
    name: "Брянская область",
    cities: ["Брянск", "Клинцы", "Новозыбков", "Дятьково", "Унеча", "Стародуб", "Сельцо", "Злынка", "Почеп", "Карачев", "Трубчевск", "Мглин", "Жуковка", "Фокино"]
  },
  {
    name: "Владимирская область",
    cities: ["Владимир", "Ковров", "Муром", "Гусь-Хрустальный", "Александров", "Кольчугино", "Киржач", "Суздаль", "Юрьев-Польский", "Собинка", "Лакинск", "Карабаново", "Струнино", "Покров", "Петушки", "Вязники", "Меленки", "Радужный"]
  },
  {
    name: "Волгоградская область",
    cities: ["Волгоград", "Волжский", "Камышин", "Михайловка", "Урюпинск", "Фролово", "Калач-на-Дону", "Котово", "Дубовка", "Ленинск", "Николаевск", "Палласовка", "Жирновск", "Серафимович", "Суровикино"]
  },
  {
    name: "Вологодская область",
    cities: ["Вологда", "Череповец", "Сокол", "Великий Устюг", "Вытегра", "Кириллов", "Белозерск", "Харовск", "Тотьма", "Грязовец", "Никольск", "Устюжна", "Бабаево"]
  },
  {
    name: "Воронежская область",
    cities: ["Воронеж", "Борисоглебск", "Россошь", "Лиски", "Нововоронеж", "Семилуки", "Острогожск", "Эртиль", "Бутурлиновка", "Калач", "Павловск", "Богучар", "Поворино", "Бобров", "Новая Усмань", "Анна"]
  },
  {
    name: "Еврейская автономная область",
    cities: ["Биробиджан", "Облучье", "Смидович", "Биракан", "Ленинское"]
  },
  {
    name: "Забайкальский край",
    cities: ["Чита", "Краснокаменск", "Борзя", "Петровск-Забайкальский", "Балей", "Нерчинск", "Могоча", "Хилок", "Шилка"]
  },
  {
    name: "Ивановская область",
    cities: ["Иваново", "Кинешма", "Шуя", "Вичуга", "Тейково", "Фурманов", "Родники", "Приволжск", "Южа", "Комсомольск", "Кохма", "Заволжск", "Наволоки"]
  },
  {
    name: "Иркутская область",
    cities: ["Иркутск", "Братск", "Ангарск", "Усть-Илимск", "Усолье-Сибирское", "Черемхово", "Шелехов", "Тулун", "Саянск", "Зима", "Свирск", "Байкальск", "Нижнеудинск", "Вихоревка", "Железногорск-Илимский"]
  },
  {
    name: "Калининградская область",
    cities: ["Калининград", "Советск", "Черняховск", "Балтийск", "Гусев", "Светлый", "Неман", "Светлогорск", "Зеленоградск", "Пионерский", "Полесск", "Багратионовск", "Гурьевск", "Правдинск", "Мамоново", "Гвардейск"]
  },
  {
    name: "Калужская область",
    cities: ["Калуга", "Обнинск", "Людиново", "Киров", "Малоярославец", "Козельск", "Боровск", "Сухиничи", "Балабаново", "Кондрово", "Медынь", "Жуков", "Таруса", "Ермолино"]
  },
  {
    name: "Камчатский край",
    cities: ["Петропавловск-Камчатский", "Елизово", "Вилючинск", "Мильково", "Усть-Камчатск", "Палана"]
  },
  {
    name: "Кемеровская область",
    cities: ["Кемерово", "Новокузнецк", "Прокопьевск", "Междуреченск", "Ленинск-Кузнецкий", "Белово", "Киселёвск", "Юрга", "Анжеро-Судженск", "Осинники", "Березовский", "Мыски", "Тайга", "Калтан", "Мариинск", "Гурьевск", "Топки", "Полысаево", "Таштагол"]
  },
  {
    name: "Кировская область",
    cities: ["Киров", "Кирово-Чепецк", "Слободской", "Вятские Поляны", "Котельнич", "Омутнинск", "Яранск", "Советск", "Уржум", "Нововятск", "Луза", "Кирс", "Белая Холуница", "Зуевка"]
  },
  {
    name: "Костромская область",
    cities: ["Кострома", "Буй", "Шарья", "Волгореченск", "Нерехта", "Галич", "Мантурово", "Чухлома", "Солигалич", "Макарьев"]
  },
  {
    name: "Краснодарский край",
    cities: ["Краснодар", "Сочи", "Новороссийск", "Армавир", "Ейск", "Туапсе", "Анапа", "Геленджик", "Кропоткин", "Тихорецк", "Белореченск", "Славянск-на-Кубани", "Апшеронск", "Лабинск", "Темрюк", "Крымск", "Курганинск", "Усть-Лабинск", "Абинск", "Приморско-Ахтарск", "Горячий Ключ", "Тимашевск", "Гулькевичи", "Кореновск"]
  },
  {
    name: "Красноярский край",
    cities: ["Красноярск", "Норильск", "Ачинск", "Канск", "Минусинск", "Железногорск", "Зеленогорск", "Лесосибирск", "Назарово", "Боготол", "Шарыпово", "Дивногорск", "Сосновоборск", "Уяр", "Енисейск", "Заозёрный", "Игарка"]
  },
  {
    name: "Курганская область",
    cities: ["Курган", "Шадринск", "Куртамыш", "Далматово", "Петухово", "Катайск", "Макушино", "Щучье"]
  },
  {
    name: "Курская область",
    cities: ["Курск", "Железногорск", "Курчатов", "Льгов", "Щигры", "Обоянь", "Рыльск", "Дмитриев", "Фатеж", "Суджа"]
  },
  {
    name: "Ленинградская область",
    cities: ["Гатчина", "Выборг", "Сосновый Бор", "Тихвин", "Кириши", "Волхов", "Луга", "Всеволожск", "Тосно", "Кингисепп", "Ивангород", "Лодейное Поле", "Приозерск", "Подпорожье", "Пикалёво", "Сланцы", "Светогорск", "Коммунар", "Сертолово", "Шлиссельбург", "Никольское"]
  },
  {
    name: "Липецкая область",
    cities: ["Липецк", "Елец", "Грязи", "Данков", "Лебедянь", "Усмань", "Чаплыгин", "Задонск"]
  },
  {
    name: "Магаданская область",
    cities: ["Магадан", "Сусуман", "Ола", "Омсукчан", "Палатка"]
  },
  {
    name: "Москва",
    cities: ["Москва"]
  },
  {
    name: "Московская область",
    cities: ["Балашиха", "Подольск", "Химки", "Королёв", "Мытищи", "Люберцы", "Красногорск", "Электросталь", "Коломна", "Одинцово", "Домодедово", "Серпухов", "Щёлково", "Орехово-Зуево", "Раменское", "Долгопрудный", "Жуковский", "Пушкино", "Реутов", "Сергиев Посад", "Воскресенск", "Ногинск", "Ступино", "Клин", "Дмитров", "Егорьевск", "Истра", "Ивантеевка", "Наро-Фоминск", "Фрязино", "Павловский Посад", "Лобня", "Озёры", "Талдом", "Кашира", "Можайск", "Луховицы", "Протвино", "Чехов", "Зарайск", "Звенигород", "Солнечногорск", "Дзержинский", "Руза", "Волоколамск", "Апрелевка", "Черноголовка"]
  },
  {
    name: "Мурманская область",
    cities: ["Мурманск", "Апатиты", "Североморск", "Мончегорск", "Кандалакша", "Кировск", "Полярные Зори", "Заполярный", "Полярный", "Оленегорск", "Ковдор", "Снежногорск"]
  },
  {
    name: "Нижегородская область",
    cities: ["Нижний Новгород", "Дзержинск", "Арзамас", "Саров", "Балахна", "Павлово", "Кстово", "Выкса", "Бор", "Кулебаки", "Городец", "Заволжье", "Семёнов", "Богородск", "Лысково", "Навашино", "Чкаловск", "Урень", "Шахунья", "Первомайск", "Перевоз"]
  },
  {
    name: "Новгородская область",
    cities: ["Великий Новгород", "Старая Русса", "Боровичи", "Валдай", "Холм", "Чудово", "Сольцы", "Пестово", "Малая Вишера", "Окуловка"]
  },
  {
    name: "Новосибирская область",
    cities: ["Новосибирск", "Бердск", "Искитим", "Куйбышев", "Барабинск", "Обь", "Татарск", "Каргат", "Тогучин", "Черепаново", "Карасук", "Болотное", "Купино"]
  },
  {
    name: "Омская область",
    cities: ["Омск", "Тара", "Калачинск", "Называевск", "Исилькуль", "Тюкалинск", "Тавричанка", "Муромцево"]
  },
  {
    name: "Оренбургская область",
    cities: ["Оренбург", "Орск", "Новотроицк", "Бузулук", "Бугуруслан", "Гай", "Сорочинск", "Соль-Илецк", "Медногорск", "Кувандык", "Абдулино", "Ясный"]
  },
  {
    name: "Орловская область",
    cities: ["Орёл", "Ливны", "Мценск", "Болхов", "Малоархангельск", "Новосиль"]
  },
  {
    name: "Пензенская область",
    cities: ["Пенза", "Кузнецк", "Заречный", "Сердобск", "Каменка", "Нижний Ломов", "Никольск", "Городище"]
  },
  {
    name: "Пермский край",
    cities: ["Пермь", "Березники", "Соликамск", "Чайковский", "Кунгур", "Лысьва", "Краснокамск", "Чусовой", "Верещагино", "Добрянка", "Александровск", "Губаха", "Кудымкар", "Чернушка", "Горнозаводск", "Кизел", "Оса", "Нытва", "Очёр", "Красновишерск", "Гремячинск"]
  },
  {
    name: "Приморский край",
    cities: ["Владивосток", "Находка", "Уссурийск", "Артём", "Дальнереченск", "Большой Камень", "Партизанск", "Арсеньев", "Спасск-Дальний", "Лесозаводск", "Дальнегорск", "Фокино"]
  },
  {
    name: "Псковская область",
    cities: ["Псков", "Великие Луки", "Остров", "Невель", "Печора", "Опочка", "Порхов", "Гдов", "Пустошка", "Себеж"]
  },
  {
    name: "Республика Адыгея",
    cities: ["Майкоп", "Адыгейск"]
  },
  {
    name: "Республика Алтай",
    cities: ["Горно-Алтайск"]
  },
  {
    name: "Республика Башкортостан",
    cities: ["Уфа", "Стерлитамак", "Салават", "Нефтекамск", "Октябрьский", "Белорецк", "Туймазы", "Сибай", "Ишимбай", "Кумертау", "Благовещенск", "Мелеуз", "Бирск", "Белебей", "Давлеканово", "Дюртюли", "Агидель"]
  },
  {
    name: "Республика Бурятия",
    cities: ["Улан-Удэ", "Северобайкальск", "Гусиноозёрск", "Кяхта", "Закаменск", "Бабушкин"]
  },
  {
    name: "Республика Дагестан",
    cities: ["Махачкала", "Хасавюрт", "Дербент", "Каспийск", "Буйнакск", "Избербаш", "Кизляр", "Кизилюрт", "Южно-Сухокумск", "Дагестанские Огни"]
  },
  {
    name: "Республика Ингушетия",
    cities: ["Магас", "Назрань", "Карабулак", "Малгобек"]
  },
  {
    name: "Республика Калмыкия",
    cities: ["Элиста", "Лагань", "Городовиковск"]
  },
  {
    name: "Республика Карелия",
    cities: ["Петрозаводск", "Кондопога", "Сегежа", "Костомукша", "Сортавала", "Питкяранта", "Олонец", "Пудож", "Кемь", "Медвежьегорск", "Беломорск", "Суоярви", "Лахденпохья"]
  },
  {
    name: "Республика Коми",
    cities: ["Сыктывкар", "Ухта", "Воркута", "Печора", "Усинск", "Инта", "Сосногорск", "Емва", "Вуктыл", "Микунь"]
  },
  {
    name: "Республика Крым",
    cities: ["Симферополь", "Севастополь", "Керчь", "Евпатория", "Ялта", "Феодосия", "Джанкой", "Алушта", "Судак", "Саки", "Бахчисарай", "Белогорск", "Армянск", "Красноперекопск", "Старый Крым", "Щёлкино"]
  },
  {
    name: "Республика Марий Эл",
    cities: ["Йошкар-Ола", "Волжск", "Козьмодемьянск", "Звенигово"]
  },
  {
    name: "Республика Мордовия",
    cities: ["Саранск", "Рузаевка", "Ковылкино", "Инсар", "Темников", "Ардатов"]
  },
  {
    name: "Республика Саха (Якутия)",
    cities: ["Якутск", "Нерюнгри", "Мирный", "Ленск", "Алдан", "Удачный", "Вилюйск", "Олёкминск", "Среднеколымск", "Верхоянск", "Покровск", "Нюрба"]
  },
  {
    name: "Республика Северная Осетия",
    cities: ["Владикавказ", "Моздок", "Беслан", "Ардон", "Алагир", "Дигора"]
  },
  {
    name: "Республика Татарстан",
    cities: ["Казань", "Набережные Челны", "Нижнекамск", "Альметьевск", "Зеленодольск", "Бугульма", "Елабуга", "Чистополь", "Лениногорск", "Азнакаево", "Заинск", "Буинск", "Агрыз", "Мензелинск", "Арск", "Кукмор", "Лаишево"]
  },
  {
    name: "Республика Тыва",
    cities: ["Кызыл", "Ак-Довурак", "Шагонар", "Чадан", "Туран"]
  },
  {
    name: "Республика Хакасия",
    cities: ["Абакан", "Черногорск", "Саяногорск", "Абаза", "Сорск"]
  },
  {
    name: "Ростовская область",
    cities: ["Ростов-на-Дону", "Таганрог", "Шахты", "Новочеркасск", "Волгодонск", "Батайск", "Новошахтинск", "Каменск-Шахтинский", "Азов", "Сальск", "Гуково", "Донецк", "Зверево", "Аксай", "Миллерово", "Морозовск", "Белая Калитва", "Семикаракорск", "Константиновск", "Красный Сулин", "Зерноград", "Цимлянск"]
  },
  {
    name: "Рязанская область",
    cities: ["Рязань", "Касимов", "Скопин", "Сасово", "Шацк", "Кораблино", "Михайлов", "Рыбное", "Новомичуринск", "Ряжск"]
  },
  {
    name: "Самарская область",
    cities: ["Самара", "Тольятти", "Сызрань", "Новокуйбышевск", "Чапаевск", "Жигулёвск", "Отрадный", "Октябрьск", "Кинель", "Похвистнево", "Нефтегорск"]
  },
  {
    name: "Санкт-Петербург",
    cities: ["Санкт-Петербург"]
  },
  {
    name: "Саратовская область",
    cities: ["Саратов", "Энгельс", "Балаково", "Балашов", "Вольск", "Ртищево", "Маркс", "Петровск", "Пугачёв", "Аткарск", "Красноармейск", "Хвалынск", "Калининск"]
  },
  {
    name: "Сахалинская область",
    cities: ["Южно-Сахалинск", "Корсаков", "Холмск", "Оха", "Невельск", "Томари", "Поронайск", "Александровск-Сахалинский", "Долинск", "Анива", "Углегорск"]
  },
  {
    name: "Свердловская область",
    cities: ["Екатеринбург", "Нижний Тагил", "Каменск-Уральский", "Первоуральск", "Серов", "Новоуральск", "Асбест", "Верхняя Пышма", "Березовский", "Полевской", "Ревда", "Краснотурьинск", "Качканар", "Реж", "Верхняя Салда", "Ирбит", "Артёмовский", "Алапаевск", "Североуральск", "Заречный", "Богданович", "Среднеуральск", "Новая Ляля", "Туринск", "Тавда", "Ивдель", "Красноуфимск", "Камышлов"]
  },
  {
    name: "Смоленская область",
    cities: ["Смоленск", "Вязьма", "Рославль", "Сафоново", "Ярцево", "Гагарин", "Десногорск", "Дорогобуж", "Рудня", "Велиж"]
  },
  {
    name: "Ставропольский край",
    cities: ["Ставрополь", "Пятигорск", "Кисловодск", "Невинномысск", "Ессентуки", "Минеральные Воды", "Георгиевск", "Железноводск", "Михайловск", "Буденновск", "Светлоград", "Зеленокумск", "Благодарный", "Изобильный", "Лермонтов"]
  },
  {
    name: "Тамбовская область",
    cities: ["Тамбов", "Мичуринск", "Рассказово", "Моршанск", "Котовск", "Уварово", "Кирсанов", "Жердевка"]
  },
  {
    name: "Тверская область",
    cities: ["Тверь", "Ржев", "Вышний Волочёк", "Кимры", "Торжок", "Конаково", "Бологое", "Удомля", "Торопец", "Осташков", "Нелидово", "Кашин", "Калязин", "Весьегонск", "Белый", "Зубцов"]
  },
  {
    name: "Томская область",
    cities: ["Томск", "Северск", "Стрежевой", "Асино", "Колпашево", "Кедровый"]
  },
  {
    name: "Тульская область",
    cities: ["Тула", "Новомосковск", "Алексин", "Донской", "Узловая", "Щёкино", "Ефремов", "Богородицк", "Кимовск", "Венёв", "Суворов", "Белёв", "Плавск"]
  },
  {
    name: "Тюменская область",
    cities: ["Тюмень", "Тобольск", "Ишим", "Ялуторовск", "Заводоуковск", "Ялуторовск"]
  },
  {
    name: "Удмуртская Республика",
    cities: ["Ижевск", "Сарапул", "Воткинск", "Глазов", "Можга", "Камбарка"]
  },
  {
    name: "Ульяновская область",
    cities: ["Ульяновск", "Димитровград", "Инза", "Барыш", "Новоульяновск", "Сенгилей"]
  },
  {
    name: "Хабаровский край",
    cities: ["Хабаровск", "Комсомольск-на-Амуре", "Амурск", "Николаевск-на-Амуре", "Советская Гавань", "Бикин", "Вяземский"]
  },
  {
    name: "Ханты-Мансийский автономный округ",
    cities: ["Ханты-Мансийск", "Сургут", "Нижневартовск", "Нефтеюганск", "Когалым", "Нягань", "Мегион", "Радужный", "Урай", "Лангепас", "Пыть-Ях", "Югорск", "Покачи", "Белоярский", "Лянтор"]
  },
  {
    name: "Челябинская область",
    cities: ["Челябинск", "Магнитогорск", "Златоуст", "Миасс", "Копейск", "Озёрск", "Троицк", "Снежинск", "Сатка", "Кыштым", "Коркино", "Южноуральск", "Чебаркуль", "Трёхгорный", "Верхний Уфалей", "Еманжелинск", "Аша", "Карабаш", "Усть-Катав", "Пласт", "Куса"]
  },
  {
    name: "Чеченская Республика",
    cities: ["Грозный", "Аргун", "Гудермес", "Урус-Мартан", "Шали"]
  },
  {
    name: "Чувашская Республика",
    cities: ["Чебоксары", "Новочебоксарск", "Канаш", "Алатырь", "Шумерля", "Цивильск"]
  },
  {
    name: "Чукотский автономный округ",
    cities: ["Анадырь", "Билибино", "Певек", "Провидения"]
  },
  {
    name: "Ямало-Ненецкий автономный округ",
    cities: ["Салехард", "Новый Уренгой", "Ноябрьск", "Надым", "Муравленко", "Губкинский", "Лабытнанги", "Тарко-Сале"]
  },
  {
    name: "Ярославская область",
    cities: ["Ярославль", "Рыбинск", "Переславль-Залесский", "Тутаев", "Углич", "Ростов", "Данилов", "Любим", "Гаврилов-Ям", "Мышкин"]
  }
];
